Infineon/SBC-for-Arduino/LiteSBC Microcontroller Library/com.ifx.tb.legacy.configwizard_2.1.30.201902131318/application/scripts/ICW_TLE94x1/TLE94x1.svd
<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<!--Version of used XSLT processor: 2.0 Altova GmbH http://www.altova.com-->
<!--Version of used XSLT: ISFR2SVD.xslt  V0.10-->
<!--Configuration of XSLT: with bit extraction =Yes;  with bit coding =Yes; decodeThe3knownBitAccessTypes = Yes; 0,r and 1,r bit extraction = No-->
<!--Version of used XSLT for fixing SVD issues: SVD_fixes.xslt  V1.4-->
<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.1" xs:noNamespaceSchemaLocation="c:\fm8_xml\XSLT\RD2ISFR\CMSIS-SVD_Schema_1_1.xsd">
	<vendor>Infineon</vendor>
	<name>TLE94x1</name>
	<version>0.2</version>
	<description>TLE94x1 Family</description>
	<addressUnitBits>8</addressUnitBits>
	<width>8</width>
	<peripherals>
		<peripheral>
			<name>CTRL</name>
			<description>Control</description>
			<baseAddress>0x0000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x40</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>M_S_CTRL</name>
					<description>Mode- and Supply Control</description>
					<addressOffset>1</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>MODE</name>
							<description>SBC Mode Control</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Normal</name>
									<description>SBC Normal Mode</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Sleep</name>
									<description>SBC Sleep Mode</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Stop</name>
									<description>SBC Stop Mode</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Soft_Reset</name>
									<description>SBC Reset: Soft Reset is executed (configuration of RSTN triggering in bit SOFT_RESET_RST)</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCC2_ON</name>
							<description>VCC2 Mode Control</description>
							<lsb>3</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>VCC2_off</name>
									<description>VCC2 off</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VCC2_on_in_Normal_Mode</name>
									<description>VCC2 on in Normal Mode</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VCC2_on_in_Normal_and_Stop_Mode</name>
									<description>VCC2 on in Normal and Stop Mode</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VCC2_always_on</name>
									<description>VCC2 always on (except in SBC Init - if not in SBC Development Mode, SBC Restart and Fail-Safe Mode)</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCC1_OV_RST</name>
							<description>VCC1 Over Voltage leading to Restart / Fail-Safe Mode enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>off</name>
									<description>VCC1_ OV is set in case of VCC1_OV; no SBC Restart or Fail-Safe is entered for VCC1_OV</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>activated</name>
									<description>VCC1_ OV is set in case of VCC1_OV; depending on the device configuration SBC Restart or SBC Fail-Safe Mode is entered (see );</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCC1_RT</name>
							<description>VCC1 Reset Threshold Control</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Vrt1</name>
									<description>Vrt1 selected (highest threshold)</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Vrt2</name>
									<description>Vrt2 selected</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Vrt3</name>
									<description>Vrt3 selected</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Vrt4</name>
									<description>Vrt4 selected</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>HW_CTRL_0</name>
					<description>Hardware Control 0</description>
					<addressOffset>2</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>SOFT_RESET_RST</name>
							<description>Soft Reset Configuration</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>RSTN_triggered_by_Soft_Reset</name>
									<description>RST will be triggered (pulled low) during a Soft Reset</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RSTN_not_triggered_by_Soft_Reset</name>
									<description>no RST trigger during a Soft Reset</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FO_ON</name>
							<description>Failure Output Activation</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>off</name>
									<description>FO not activated by software, FO will be activated by specified failures (see )</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>on</name>
									<description>FO activated by software (via SPI), only if configured as FO</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CP_EN</name>
							<description>Charge Pump Output Enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>off</name>
									<description>Charge Pump is OFF</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>on</name>
									<description>Charge Pump Output is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CFG1</name>
							<description>Configuration Select 1 (see also )</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>after_2nd</name>
									<description>Depending on hardware configuration, SBC Restart or Fail-Safe Mode is reached after the 2. watchdog trigger failure (=default) - Config 3/4</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>after_1st</name>
									<description>Depending on hardware configuration, SBC Restart or Fail-Safe Mode is reached after the 1. watchdog trigger failure - Config 1/2</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WD_CTRL</name>
					<description>Watchdog Control</description>
					<addressOffset>3</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>CHECKSUM</name>
							<description>Watchdog Setting Check Sum Bit</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0</name>
									<description>Counts as 0 for checksum calculation</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<description>Counts as 1 for checksum calculation</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WD_STM_EN_0</name>
							<description>Watchdog Deactivation during Stop Mode, bit 0 ()</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>active</name>
									<description>Watchdog is active in Stop Mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>off</name>
									<description>Watchdog is deactivated in Stop Mode</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WD_WIN</name>
							<description>Watchdog Type Selection</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Time-out</name>
									<description>Watchdog works as a Time-Out watchdog</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Window</name>
									<description>Watchdog works as a Window watchdog</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WD_EN_WK_BUS</name>
							<description>Watchdog Enable after Bus (CAN) Wake in SBC Stop Mode</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>off</name>
									<description>Watchdog will not start after a CAN wake</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>on</name>
									<description>Watchdog starts with a long open window after CAN Wake</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WD_TIMER</name>
							<description>Watchdog Timer Period</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>10ms</name>
									<description>10ms</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>20ms</name>
									<description>20ms</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>50ms</name>
									<description>50ms</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>100ms</name>
									<description>100ms</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>200ms</name>
									<description>200ms</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>500ms</name>
									<description>500ms</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1s</name>
									<description>1000ms</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>10s</name>
									<description>10000ms</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BUS_CTRL_0</name>
					<description>Bus Control 0</description>
					<addressOffset>4</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>CAN</name>
							<description>HS-CAN Module Modes (CAN_2 is rw type)</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>off</name>
									<description>CAN OFF</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake_capable</name>
									<description>CAN is wake capable (no SWK)</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>receive_only</name>
									<description>CAN Receive Only Mode (no SWK)</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>normal</name>
									<description>CAN Normal Mode (no SWK)</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>off</name>
									<description>CAN OFF</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake_capable_(SWK)</name>
									<description>CAN is wake capable with SWK</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>receive_only_(SWK)</name>
									<description>CAN Receive Only Mode with SWK</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>normal_(SWK)</name>
									<description>CAN Normal Mode with SWK</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WK_CTRL_0</name>
					<description>Internal Wake Input Control</description>
					<addressOffset>6</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>TIMER_WK_EN</name>
							<description>Timer Wake Source Control (for cyclic wake)</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<description>Timer wake disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>Timer is enabled as a wake source</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WD_STM_EN_1</name>
							<description>Watchdog Deactivation during Stop Mode, bit 1 ()</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>WD_active_in_stop_mode</name>
									<description>Watchdog is active in Stop Mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>off</name>
									<description>Watchdog is deactivated in Stop Mode</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WK_CTRL_1</name>
					<description>External Wake Source Control</description>
					<addressOffset>7</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>INT_GLOBAL</name>
							<description>Global Interrupt Configuration (see also )</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>wake_only</name>
									<description>Only wake sources trigger INTN (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>all_status_bits</name>
									<description>All status information register bits will trigger INTN (including all wake sources)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WK_MEAS</name>
							<description>Wake / Voltage Sensing Selection (see also )</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>wake</name>
									<description>Wake functionality enabled for WK</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>voltage_sensing</name>
									<description>Voltage sensing functionality enabled, no wake-up events are generated</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WK_EN</name>
							<description>WK Wake Source Control</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<description>WK wake disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>WK is enabled as a wake source</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WK_PUPD_CTRL</name>
					<description>Wake Input Level Control</description>
					<addressOffset>8</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>GPIO_WK_PUPD</name>
							<description>GPIO WK Pull-Up / Pull-Down Configuration (only if GPIO configured as WK)</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>none</name>
									<description>No pull-up / pull-down selected</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>pull-down</name>
									<description>Pull-down resistor selected</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>pull-up</name>
									<description>Pull-up resistor selected</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>automatic</name>
									<description>Automatic switching to pull-up or pull-down</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WK_PUPD</name>
							<description>WK Pull-Up / Pull-Down Configuration</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>none</name>
									<description>No pull-up / pull-down selected</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>pull-down</name>
									<description>Pull-down resistor selected</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>pull-up</name>
									<description>Pull-up resistor selected</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>automatic</name>
									<description>Automatic switching to pull-up or pull-down</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BUS_CTRL_3</name>
					<description>Bus Control 3</description>
					<addressOffset>11</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>CAN_Flash</name>
							<description>HS-CAN Flash Mode Activation</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<description>Flash Mode disabled: CAN communication up to 5MBaud</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>Flash Mode enabled: CAN communication for higher than 5MBaud (higher emission on CAN bus - no slew rate control)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
