Infineon/SBC-for-Arduino/LiteSBC Microcontroller Library/com.ifx.tb.legacy.configwizard_2.1.30.201902131318/application/scripts/ICW_TLE94x1/TLE94x1.svd
				<register>
					<name>TIMER_CTRL</name>
					<description>Timer Control and Selection</description>
					<addressOffset>12</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>TIMER_ON</name>
							<description>Timer On-Time Configuration</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>off_(low)</name>
									<description>OFF / Low (timer not running, HSx output is low)</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>0.1ms</name>
									<description>0.1ms on-time</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>0.3ms</name>
									<description>0.3ms on-time</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1.0ms</name>
									<description>1.0ms on-time</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>10ms</name>
									<description>10ms on-time</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>20ms</name>
									<description>20ms on-time</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>off_(high)</name>
									<description>OFF / HIGH (timer not running, HSx output is high)</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>reserved</name>
									<description>reserved OFF / HIGH (timer not running, HSx output is high)</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TIMER_PER</name>
							<description>Timer Period Configuration</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>10ms</name>
									<description>10ms</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>20ms</name>
									<description>20ms</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>50ms</name>
									<description>50ms</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>100ms</name>
									<description>100ms</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>200ms</name>
									<description>200ms</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>500ms</name>
									<description>500ms</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1s</name>
									<description>1s</description>
									<value>0b0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2s</name>
									<description>2s</description>
									<value>0b0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5s</name>
									<description>5s</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>10s</name>
									<description>10s</description>
									<value>0b1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>20s</name>
									<description>20s</description>
									<value>0b1010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>50s</name>
									<description>50s</description>
									<value>0b1011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>100s</name>
									<description>100s</description>
									<value>0b1100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>200s</name>
									<description>200s</description>
									<value>0b1101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>500s</name>
									<description>500s</description>
									<value>0b1110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1000s</name>
									<description>1000s</description>
									<value>0b1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>HW_CTRL_1</name>
					<description>Hardware Control 1</description>
					<addressOffset>14</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>RSTN_HYS</name>
							<description>VCC1 Undervoltage Reset Hysteresis Selection (see also for more information)</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>default</name>
									<description>default hysteresis applies as specified in the electrical characteristics table</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Vrt1</name>
									<description>the highest rising threshold (Vrt1,r) is always used for the release of the undervoltage reset</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TSD2_DEL</name>
							<description>TSD2 Minimum Waiting Time Selection</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1_s</name>
									<description>Minimum waiting time until TSD2 is released again is always 1s</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>extended</name>
									<description>Minimum waiting time until TSD2 is released again is 1s, after &gt;16 consecutive TSD2 events, it will be extended to x64</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RSTN_DEL</name>
							<description>Reset Delay Time Selection</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>standard</name>
									<description>The extended reset delay time is selected (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>reduced</name>
									<description>The reduced reset delay time is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CFG_LOCK_0</name>
							<description>Configuration Lock Bit - Level 0</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>un-locked</name>
									<description>CP_EN and GPIO can be modified</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>locked</name>
									<description>CP_EN and GPIO is locked and cannot be modified</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>HW_CTRL_2</name>
					<description>Hardware Control 2</description>
					<addressOffset>15</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>2MHZ_FREQ</name>
							<description>SMPS and Charge Pump Switching Frequency</description>
							<lsb>5</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1.8MHz</name>
									<description>1.8MHz</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2.0MHz</name>
									<description>2.0MHz</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2.2MHz</name>
									<description>2.2MHz (default value)</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2.4MHz</name>
									<description>2.4MHz</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>450kHz</name>
									<description>divider by 4 is active, switching frequency is 450kHz</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>500kHz</name>
									<description>divider by 4 is active, switching frequency is 500kHz</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>550kHz</name>
									<description>divider by 4 is active, switching frequency is 550kHz</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>600kHz</name>
									<description>divider by 4 is active, switching frequency is 600kHz</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>I_PEAK_TH</name>
							<description>VCC1 Active Peak Threshold Selection</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>low</name>
									<description>low VCC1 active peak threshold selected (ICC1,peak_1)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>high</name>
									<description>high VCC1 active peak threshold selected (ICC1,peak_2).</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SS_MOD_FR</name>
							<description>Spread Spectrum Modulation Frequency Setting of integrated 2MHz oscillator for charge pump and SMPS regulator (Valid for 2MHz_FREQ = ‘001')(if low frequency range is selected, then only possible configuration is ‘11', other values can be selected but are ignored)</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<description>Spread Spectrum disabled</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>15.625kHz</name>
									<description>15.625kHz Modulation Frequency</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>31.250kHz</name>
									<description>31.250kHz Modulation Frequency</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>62.500kHz</name>
									<description>62.500kHz Modulation Frequency</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DCDC_OFFSET_EN</name>
							<description>SMPS Regulation Voltage in SBC Normal Mode for Loads below the Active Peak Threshold (Soft Reset Value = ‘0')</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>off</name>
									<description>No offset: VCC1 output is always regulated at the same voltage</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>on</name>
									<description>Offset activated: Only low-power regulator is active below the active peak threshold, i.e. same behavior as in SBC Stop Mode.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CFG_LOCK_1</name>
							<description>Configuration Lock Bit - Level 1</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>un-locked</name>
									<description>Bits with bit type ‘rwl' (except CP_EN and GPIO) can be modified</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>locked</name>
									<description>Bits with bit type ‘rwl' (except CP_EN and GPIO) are locked and cannot be modified anymore until next device power-up.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIO_CTRL</name>
					<description>GPIO Configuration Control</description>
					<addressOffset>23</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>GPIO</name>
							<description>GPIO Configuration</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>FO</name>
									<description>FO selected (default)</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FO</name>
									<description>FO selected</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FO</name>
									<description>FO selected</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>High-Side_Timer</name>
									<description>High-Side controlled by TIMER (cyclic sense)</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>off</name>
									<description>OFF</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Wake_input</name>
									<description>Wake input enabled (16us static filter)</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Low-Side_PWM</name>
									<description>Low-Side Switch controlled by PWM</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>High-Side_PWM</name>
									<description>High-Side Switch controlled by PWM</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PWM_CTRL</name>
					<description>PWM Configuration Control</description>
					<addressOffset>24</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>PWM_DC</name>
							<description>PWM Duty Cycle Setting (bit0 = LSB; bit7 = MSB)</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PWM_FREQ_CTRL</name>
					<description>PWM Frequency Configuration Control</description>
					<addressOffset>28</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>PWM_FREQ</name>
							<description>Spread Spectrum Modulation Frequency Setting</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>100Hz</name>
									<description>100Hz configuration</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>200Hz</name>
									<description>200Hz configuration</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>325Hz</name>
									<description>325Hz configuration</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>400Hz</name>
									<description>400Hz configuration</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>HW_CTRL_3</name>
					<description>Hardware Control 3</description>
					<addressOffset>29</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>TSD_THR</name>
							<description>Thermal Shutdown Threshold (TSD1 &amp; TSD2) Configuration</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>default</name>
									<description>Default shutdown threshold selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>high</name>
									<description>higher shutdown threshold selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ICC1_LIM_ADJ</name>
							<description>Configuration of ICC1 current limitation</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>-25%</name>
									<description>1 step down from default value (-25% of typ. default)</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>default</name>
									<description>default value (typ. 1000mA)</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>+20%</name>
									<description>1 step up form default value (+20% of default)</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>+50%</name>
									<description>2 steps up from default value (+50% of default)</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SYS_STATUS_CTRL_0</name>
					<description>System Status Control Low Byte</description>
					<addressOffset>30</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>SYS_STAT_L</name>
							<description>System Status Control Low Byte (bit0=LSB; bit7=MSB)</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYS_STATUS_CTRL_1</name>
					<description>System Status Control High Byte</description>
					<addressOffset>31</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>SYS_STAT_H</name>
							<description>System Status Control High Byte (bit8=LSB; bit15=MSB)</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_CTRL</name>
					<description>CAN Selective Wake Control</description>
					<addressOffset>32</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>OSC_CAL</name>
							<description>Oscillator Calibration Mode</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<description>Oscillator Calibration is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>Oscillator Calibration is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TRIM_EN</name>
							<description>(Un)locking mechanism of oscillator recalibration</description>
							<lsb>5</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>locked_0</name>
									<description>locked</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>locked_1</name>
									<description>locked</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>locked_2</name>
									<description>locked</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>unlocked</name>
									<description>unlocked</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CANTO_MASK</name>
							<description>CAN Time Out Masking</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no_INTN</name>
									<description>CAN time-out is masked - no interrupt (on pin INTN) is triggered</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTN</name>
									<description>CAN time-out is signaled on INTN</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CFG_VAL</name>
							<description>SWK Configuration valid</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_valid</name>
									<description>Configuration is not valid (SWK not possible)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>valid</name>
									<description>SWK configuration valid, needs to be set to enable SWK</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_BTL0_CTRL</name>
					<description>SWK Bit Timing Logic Control1</description>
					<addressOffset>33</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>TBIT</name>
							<description>Number of Time Quanta in a Bit Time</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_BTL1_CTRL</name>
					<description>SWK Bit Timing Control2</description>
					<addressOffset>34</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>SP</name>
							<description>Sampling Point Position</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_ID3_CTRL</name>
					<description>SWK WUF Identifier bits 28...21</description>
					<addressOffset>35</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>ID28_21</name>
							<description>WUF Identifier Bits 28...21</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
