Infineon/SBC-for-Arduino/LiteSBC Microcontroller Library/com.ifx.tb.legacy.configwizard_2.1.30.201902131318/application/scripts/ICW_TLE94x1/TLE94x1.svd
				<register>
					<name>SWK_ID2_CTRL</name>
					<description>SWK WUF Identifier bits 20...13</description>
					<addressOffset>36</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>ID20_13</name>
							<description>WUF Identifier Bits 20...13</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_ID1_CTRL</name>
					<description>SWK WUF Identifier bits 12...5</description>
					<addressOffset>37</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>ID12_5</name>
							<description>WUF Identifier Bits 12...5</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_ID0_CTRL</name>
					<description>SWK WUF Identifier bits 4...0</description>
					<addressOffset>38</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>ID4_0</name>
							<description>WUF Identifier Bits 4..0</description>
							<lsb>2</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RTR</name>
							<description>Remote Transmission Request Field (acc. ISO 11898-1)</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<description>Normal Data Frame</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>Remote Transmission Request</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IDE</name>
							<description>Identifier Extension Bit</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>11bit</name>
									<description>Standard Identifier Length (11 bit)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>29bit</name>
									<description>Extended Identifier Length (29 bit)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_MASK_ID3_CTRL</name>
					<description>SWK WUF Identifier Mask bits 28...21</description>
					<addressOffset>39</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>MASK_ID28_21</name>
							<description>WUF Identifier Mask Bits 28...21</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ignored</name>
									<description>Unmasked - bit is ignored</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>Masked - bit is compared in CAN frame</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_MASK_ID2_CTRL</name>
					<description>SWK WUF Identifier Mask bits 20...13</description>
					<addressOffset>40</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>MASK_ID20_13</name>
							<description>WUF Identifier Mask Bits 20...13</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ignored</name>
									<description>Unmasked - bit is ignored</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>Masked - bit is compared in CAN frame</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_MASK_ID1_CTRL</name>
					<description>SWK WUF Identifier Mask bits 12...5</description>
					<addressOffset>41</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>MASK_ID12_5</name>
							<description>WUF Identifier Mask Bits 12...5</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ignored</name>
									<description>Unmasked - bit is ignored</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>Masked - bit is compared in CAN frame</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_MASK_ID0_CTRL</name>
					<description>SWK WUF Identifier bits 4...0</description>
					<addressOffset>42</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>MASK_ID4_0</name>
							<description>WUF Identifier MASK Bits 4..0</description>
							<lsb>2</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>irgnored</name>
									<description>Unmasked - bit is ignored</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>Masked - bit is compared in CAN frame</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_DLC_CTRL</name>
					<description>SWK Frame Data Length Code Control</description>
					<addressOffset>43</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>DLC</name>
							<description>Payload length in number of bytes</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0</name>
									<description>Frame Data Length = 0 or cleared</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<description>Frame Data Length = 1</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>Frame Data Length = 2</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3</name>
									<description>Frame Data Length = 3</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4</name>
									<description>Frame Data Length = 4</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5</name>
									<description>Frame Data Length = 5</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>6</name>
									<description>Frame Data Length = 6</description>
									<value>0b0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7</name>
									<description>Frame Data Length = 7</description>
									<value>0b0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8</name>
									<description>Frame Data Length = 8</description>
									<value>0b1000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_DATA7_CTRL</name>
					<description>SWK Data7 Register</description>
					<addressOffset>44</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>DATA7</name>
							<description>Data7 byte content(bit0=LSB; bit7=MSB)</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_DATA6_CTRL</name>
					<description>SWK Data6 Register</description>
					<addressOffset>45</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>DATA6</name>
							<description>Data6 byte content (bit0=LSB; bit7=MSB)</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_DATA5_CTRL</name>
					<description>SWK Data5 Register</description>
					<addressOffset>46</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>DATA5</name>
							<description>Data5 byte content (bit0=LSB; bit7=MSB)</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_DATA4_CTRL</name>
					<description>SWK Data4 Register</description>
					<addressOffset>47</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>DATA4</name>
							<description>Data4 byte content (bit0=LSB; bit7=MSB)</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_DATA3_CTRL</name>
					<description>SWK Data3 Register</description>
					<addressOffset>48</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>DATA3</name>
							<description>Data3 byte content (bit0=LSB; bit7=MSB)</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_DATA2_CTRL</name>
					<description>SWK Data2 Register</description>
					<addressOffset>49</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>DATA2</name>
							<description>Data2 byte content (bit0=LSB; bit7=MSB)</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_DATA1_CTRL</name>
					<description>SWK Data1 Register</description>
					<addressOffset>50</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>DATA1</name>
							<description>Data1 byte content (bit0=LSB; bit7=MSB)</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_DATA0_CTRL</name>
					<description>SWK Data0 Register</description>
					<addressOffset>51</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>DATA0</name>
							<description>Data0 byte content (bit0=LSB; bit7=MSB)</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_CAN_FD_CTRL</name>
					<description>CAN FD Configuration Control Register</description>
					<addressOffset>52</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>DIS_ERR_CNT</name>
							<description>Error Counter Disable Function</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>counter_enabled</name>
									<description>Error Counter is enabled during SWK</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>counter_disabled</name>
									<description>Error counter is disabled during SWK only if CAN_FD_EN = ‘1'</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RX_FILT_BYP</name>
							<description>RX Receiver Filter Bypass</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<description>RX Filter not bypassed</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>RX Filter bypassed</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FD_FILTER</name>
							<description>CAN FD Dominant Filter Time</description>
							<lsb>1</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50 ns</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>100ns</name>
									<description>100 ns</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>150ns</name>
									<description>150 ns</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>200ns</name>
									<description>200 ns</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>250ns</name>
									<description>250 ns</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>300ns</name>
									<description>300 ns</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>350ns</name>
									<description>350 ns</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>700ns</name>
									<description>700 ns</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAN_FD_EN</name>
							<description>CAN FD Tolerant Mode</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<description>CAN FD Tolerant Mode disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>CAN FD Tolerant Mode enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_OSC_TRIM_CTRL</name>
					<description>SWK Oscillator Trimming Register</description>
					<addressOffset>56</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>TRIM_OSC</name>
							<description>Oscillator trimming (bit0=LSB; bit7=MSB); (only writable if TRIM_EN = ‘11')</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_OPT_CTRL</name>
					<description>Selective Wake Options Register</description>
					<addressOffset>57</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>RX_WK_SEL</name>
							<description>SWK Receiver selection (only accessible if TRIM_EN = ‘11')</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Low-Power_Receiver</name>
									<description>Low-Power Receiver selected during SWK</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Standard_Receiver</name>
									<description>Standard Receiver selected during SWK</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TRIM_OSC</name>
							<description>Oscillator trimming (bit8=LSB; bit12=MSB); (only writable if TRIM_EN = ‘11')</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_OSC_CAL_H_STAT</name>
					<description>SWK Oscillator Calibration High Register</description>
					<addressOffset>58</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>OSC_CAL_H</name>
							<description>Oscillator Calibration High Register</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_OSC_CAL_L_STAT</name>
					<description>SWK Oscillator Calibration Low Register</description>
					<addressOffset>59</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>OSC_CAL_L</name>
							<description>Oscillator Calibration Low Register</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_CDR_CTRL1</name>
					<description>CDR Control 1 Register</description>
					<addressOffset>60</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>SEL_FILT</name>
							<description>Select Time Constant of Filter</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>8</name>
									<description>Time constant 8</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16(default)</name>
									<description>Time constant 16 (default)</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32</name>
									<description>Time constant 32</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>adaptive</name>
									<description>adapt distance between falling edges 2, 3 bit: Time constant 32 distance between f. edges 4, 5, 6, 7, 8 bit: Time constant 16 distance between falling edges 9, 10 bit: Time constant 8</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CDR_EN</name>
							<description>Enable CDR</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<description>CDR disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>CDR enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_CDR_CTRL2</name>
					<description>CDR Control 2Register</description>
					<addressOffset>61</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>SEL_OSC_CLK</name>
							<description>Input Frequency for CDR module</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_CDR_LIMIT_HIGH_CTRL</name>
					<description>SWK CDR Upper Limit Control</description>
					<addressOffset>62</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>CDR_LIM_H</name>
							<description>Upper Bit Time Detection Range of Clock and Data Recovery</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_CDR_LIMIT_LOW_CTRL</name>
					<description>SWK CDR Lower Limit Control</description>
					<addressOffset>63</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>CDR_LIM_L</name>
							<description>Lower Bit Time Detection Range of Clock and Data Recovery</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
