Infineon/SBC-for-Arduino/LiteSBC Microcontroller Library/com.ifx.tb.legacy.configwizard_2.1.30.201902131318/application/scripts/ICW_TLE94x1/TLE94x1.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>STAT</name>
			<description>Status</description>
			<baseAddress>0x0040</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x40</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>SUP_STAT_1</name>
					<description>Supply Voltage Fail Status</description>
					<addressOffset>0</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>VS_UV</name>
							<description>VS Undervoltage Detection (VS,UV)</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No VS undervoltage detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>VS undervoltage detected (detection is only active when VCC1 is enabled - see also note below)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_OV</name>
							<description>VS Overvoltage Detection (VS,UV)</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No VS overvoltage detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>VS overvoltage detected (detection is only active when VCC1 is enabled - see also note below)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCC1_OV</name>
							<description>VCC1 Overvoltage Detection ()</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No VCC1 overvoltage warning</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>VCC1 overvoltage detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCC1_WARN</name>
							<description>VCC1 Undervoltage Prewarning ()</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No VCC1 undervoltage prewarning</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>VCC1 undervoltage prewarning detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SUP_STAT_0</name>
					<description>Supply Voltage Fail Status</description>
					<addressOffset>1</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>POR</name>
							<description>Power-On Reset Detection</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No POR</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>POR occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCC2_OT</name>
							<description>VCC2 Over Temperature Detection</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No over temperature</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>VCC2 over temperature detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCC2_UV</name>
							<description>VCC2 Under Voltage Detection ()</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No VCC2 Under voltage</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>VCC2 under voltage detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCC1_SC</name>
							<description>VCC1 Short to GND Detection (&lt;Vrtx for t&gt;2ms after switch on)</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No short</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>VCC1 short to GND detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCC1_UV</name>
							<description>VCC1 UV-Detection (due to Vrtx reset)</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No VCC1_UV detection</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>VCC1 UV-Fail detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>THERM_STAT</name>
					<description>Thermal Protection Status</description>
					<addressOffset>2</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>TSD2_SAFE</name>
							<description>TSD2 Thermal Shut-Down Safe State Detection</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No TSD2 safe state detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>TSD2 safe state detected: &gt;16 consecutive TSD2 events occurred, next TSD2 waiting time will be 60s</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TSD2</name>
							<description>TSD2 Thermal Shut-Down Detection</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No TSD2 event</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>TSD2 OT detected - leading to SBC Fail-Safe Mode</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TSD1</name>
							<description>TSD1 Thermal Shut-Down Detection</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No TSD1 fail</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>TSD1 OT detected (affected module is disabled)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TPW</name>
							<description>Thermal Pre Warning</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No Thermal Pre warning</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>Thermal Pre warning detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DEV_STAT</name>
					<description>Device Information Status</description>
					<addressOffset>3</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>DEV_STAT</name>
							<description>Device Status before Restart Mode</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>cleared</name>
									<description>Cleared (Register must be actively cleared)</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>failure</name>
									<description>Restart due to failure (WD fail, TSD2, VCC1_UV, trial to access SLEEP MODE without any wake source activated); also after a wake from Fail-Safe Mode</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Sleep_Mode</name>
									<description>Sleep Mode</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>reserved</name>
									<description>Reserved</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WD_FAIL</name>
							<description>Number of WD-Failure Events (1/2 WD failures depending on CFG1)</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No WD Fail</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<description>1x WD Fail, FO activation - Config 2 selected</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>2x WD Fail, FO activation - Config 1 / 3 / 4 selected</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>reserved</name>
									<description>Reserved (never reached)</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPI_FAIL</name>
							<description>SPI Fail Information</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No SPI fail</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>Invalid SPI command detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FAILURE</name>
							<description>Activation of Fail Output FO</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No Failure</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>Failure occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BUS_STAT</name>
					<description>Bus Communication Status</description>
					<addressOffset>4</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>CANTO</name>
							<description>CAN Time Out Detection</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>Normal operation</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>CAN Time Out detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYSERR</name>
							<description>SWK System Error</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>Selective Wake Mode is possible</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>System Error detected, SWK enabling not possible</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAN_FAIL</name>
							<description>CAN Failure Status</description>
							<lsb>1</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>none</name>
									<description>No error</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TSD_shutdown</name>
									<description>CAN TSD shutdown</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TXD_DOM</name>
									<description>CAN_TXD_DOM: TXD dominant time out detected ()</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BUS_DOM</name>
									<description>CAN_BUS_DOM: BUS dominant time out detected ()</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCAN_UV</name>
							<description>Under voltage CAN Bus Supply</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>Normal operation</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>CAN Supply under voltage detected. Transmitter disabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WK_STAT_0</name>
					<description>Wake-up Source and Information Status 0</description>
					<addressOffset>6</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>CAN_WU</name>
							<description>Wake up via CAN Bus</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No Wake up</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>Wake up</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TIMER_WU</name>
							<description>Wake up via TimerX</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No Wake up</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>Wake up</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WK_WU</name>
							<description>Wake up via WK</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No Wake up</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>Wake up</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WK_STAT_1</name>
					<description>Wake-up Source and Information Status 1</description>
					<addressOffset>7</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>GPIO_WK_WU</name>
							<description>Wake up via GPIO if configured as WK</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No Wake up</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>Wake up</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WK_LVL_STAT</name>
					<description>WK Input Level</description>
					<addressOffset>8</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>SBC_DEV_LVL</name>
							<description>Status of SBC Operating Mode at TEST Pin</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>User-Mode</name>
									<description>User Mode activated</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Development-Mode</name>
									<description>SBC Development Mode activated</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CFG0_STATE</name>
							<description>Device Configuration Status on pin INTN</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_ext._Pull-up_on_INTN</name>
									<description>No external pull-up resistor connected on INTN (Config 2/4)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Ext._Pull-up_on_INTN</name>
									<description>External pull-up resistor connected on INTN (Config 1/3)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO_LVL</name>
							<description>Status of GPIO if configured as GPIO (WK, LS or HS function)</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>low_level</name>
									<description>Low Level (=0)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>high_level</name>
									<description>High Level (=1)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WK_LVL</name>
							<description>Status of WK</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>low_level</name>
									<description>Low Level (=0)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>high_level</name>
									<description>High Level (=1)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIO_OC_STAT</name>
					<description>GPIO Overcurrent Status</description>
					<addressOffset>20</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>GPIO_OC</name>
							<description>Overcurrent Detection on GPIO (if configured as LS or HS)</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No OC</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>OC detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIO_OL_STAT</name>
					<description>GPIO Open-Load Status</description>
					<addressOffset>21</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>GPIO_OL</name>
							<description>Open-Load Detection on GPIO (if configured as HS)</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No OL</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>OL detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
